Repository: rokubot/bot
Catalog: locales/*/LC_MESSAGES/lvl.po
Languages: es_es

source: Reward members with xp for talking and even give roles at milestones **To enable leveling, use `ro enable leveling` command.**
es_es: Recompensa a los miembros por hablar con xp e incluso otorga roles en los hitos. **Para habilitar nivelación, usa el comando `ro enable leveling`.**

source: **Sorry,** Only **Server Owner** can run this command
es_es: **Perdón,** solo **Dueño de Servidor** puede usar este comando.

source: `{mention}` - To mention(ping) the user. __Example__ {.mention} `{user}` - Name of the user. __Example__ {.user} `{username}` Username of the user. __Example:__ {.username} `{userid}` - UserID of the user. __Example:__ {.id} `{level}` - Level of the user. __Example:__ 23 `{avatar}` - Avatar of the user. `{role.name}` - The name of the role you're giving to the user (This only works for reward messages) __Example:__ @lovely-role `{role.mention}` - The mention (ping) of the role you're giving to the user (This only works for reward messages) __Example:__ @lovely-role `{role.id}` - The ID of the role you're giving to the user (This only works for reward messages) __Example:__ 1310856420320612392
es_es: `{mention}` - Para mencionar(ping) al usuario. __Ejemplo__ {.mention} `{user}` - Nombre del usuario. __Ejemplo__ {.user} `{username}` Nombre de usuario del usuario. __Ejemplo:__ {.username} `{userid}` - ID de usuario del usuario. __Ejemplo:__ {.id} `{level}` - Nivel del usuario. __Ejemplo:__ 23 `{avatar}` - Avatar del usuario. `{role.name}` - El nombre del rol que le estás dando al usuario. (Esto solo funciona para los mensajes de recompensa) __Ejemplo:__ @lovely-role `{role.mention}` - La mención (ping) del rol que le estás dando al usuario. (Esto solo funciona para los mensajes de recompensa) __Ejemplo:__ @lovely-role `{role.id}` - El ID del rol que le estás dando al usuario. (Solo funciona para los mensajes de recompensa) __Ejemplo:__ 1310856420320612392

source: Auto Level Roles - {lvl}
es_es: Rol de nivel automático - {lvl}

source: Auto Level Role - Replace old roles
es_es: Rol de nivel automático - Reemplazar roles antiguos

source: **{username}** has leveled up to level {new_lvl}
es_es: **{username}** ha subido al nivel {new_lvl}**

source: You have been given <@&{role_id}> since you have reached level {lvl}
es_es: Has sido otorgado <@&{role_id}> ya que has alcanzado el nivel {lvl}

source: Leveling commands cannot be used in DMs
es_es: Los comandos de nivelación no pueden ser usados por mensaje directo.

source: Shows the server level, xp and rank of mentioned member If member is not mentioned, shows authors level, rank and xp.
es_es: Muestra el nivel del servidor, xp y rango del miembro mencionado. Si no se mencionó a un miembro, muestra nivel del autor, rango y xp.

source: Shows server level (rank) leaderboard
es_es: Muestra tabla de clasificación de niveles del servidor (rango).

source: <a:blloading:731862370380546069> loading
es_es: <a:blloading:731862370380546069> cargando

source: Set where I should send leveling messages
es_es: Establece en dónde debo mandar los mensajes de subida de nivel.

source: I don't have enough permissions to send message in that channel.
es_es: No tengo los permisos suficientes para mandar mensajes en ese canal.

source: I require atleast `Send Messages`, `Embed Links` Permissions
es_es: Requiero por lo menos los permisos de `Enviar mensajes` e `Insertar enlaces`.

source: {tick} **Now I will send all levelup messages to** {channel}
es_es: {tick} **Ahora enviaré todos los mensajes de subida de nivel a** {channel}

source: Makes Roku send levelup messages where they levelup This is the default
es_es: Hace que Roku envíe mensajes de subida de nivel donde suben de nivel. Ésto es lo predeterminado.

source: {tick} Now I will send levelup messages on the place where they levelup
es_es: {tick} Ahora enviaré los mensajes de subida de nivel al lugar donde subieron de nivel.

source: Settings for auto level roles
es_es: Configuraciones para los roles de nivel automáticos.

source: Set roles I should give out to people when they level up to a specific level
es_es: Establece los roles que debo otorgar a las personas cuando suban de nivel a un nivel específico.

source: {role} is above my role, Drag my role to top to fix this issue!
es_es: {role} está por encima de mi rol. Arrastralo hasta arriba para arreglar este problema!

source: **Sorry,** This role is managed by discord. I can't add or remove it
es_es: **Perdón, este rol es gestionado por Discord. No puedo agregarlo ni removerlo.**

source: Whoops, You cannot add anymore roles. If u want to add, subscribe to premium.
es_es: ¡Ups! No puedes agregar más roles. Si deseas agregar más, suscríbete al plan premium.

source: Support Roku by subscribing to premium and
es_es: Apoya a Roku suscribiéndote al plan premium y

source: enjoy the premuim features!
es_es: Disfruta de las funciones premium!

source: Click here for more info : https://ko-fi.com/rokubot
es_es: Haz click aquí para más información: https://ko-fi.com/rokubot

source: {tick} Done! I will be giving {role} role when they reach level **{level}**
es_es: {tick} Listo! Daré el rol {role} cuando lleguen al nivel **{level}**

source: Remove levelroles from certain levels, if you have already setup.
es_es: Elimina roles de nivel de ciertos niveles, si ya los has configurado.

source: No roles or levels have been added yet!
es_es: No se han agregado roles ni niveles todavía!

source: Role for that level was not added before.
es_es: El rol para ese nivel no fue agregado anteriormente.

source: {tick} Done! I won't be adding any roles for level {level}
es_es: {tick} Listo! No agregaré rols para el nivel {level}

source: Shows the levelroles that you have added
es_es: Muestra los roles de nivel que has agregado.

source: No roles were added.
es_es: No se han agregado roles.

source: **{i}. Level {lvl}** - {role}
es_es: **{i}. Nivel {lvl}** - {role}

source: Level Roles
es_es: Roles de nivel

source: Setup Custom levelmessage for your lovely server!
es_es: Configura un mensaje de subida de nivel personalizados para tu lindo servidorcito!

source: **{tick} Levelup Message has been set. Type `{prefix}leveltest` to test how it looks!**
es_es: **{tick} Mensaje de subida de nivel ha sido establecido. Escribe `{prefix}leveltest` para probar cómo se ve!**

source: Test Your LevelMessage Setup! You need to have role rewardonly disabled for this to work. If u have enabled role rewardonly, please use `rewardtest` command.
es_es: Prueba tu configuración de tu mensaje de subida de nivel! Necesitas tener role rewardonly deshabilitado para que ésto funcione. Si tiene habilitado role rewardonly, por favor usa el comando `rewardtest`.

source: Reward only has been enabled, please use `{prefix}rewardtest` instead
es_es: Solo recompensa ha sido habilitado, por favor usa `{prefix}rewardtest` en su lugar.

source: Test Your Reward Message Setup!
es_es: Prueba tu configuración de mensajes de recompensa!

source: You didn't setup reward roles, please setup reward roles first
es_es: No configuraste roles de recompensa, por favor configúralos primero.

source: This role is not a reward role
es_es: Este rol no es un rol de recompensa.

source: Setup Custom role reward message for your lovely server!
es_es: Configura un mensaje de recompensa de roles personalizados para tu lindo servidorcito!

source: You didn't setup reward roles, please setup reward roles first.
es_es: No configuraste roles de recompensa, por favor configuralos primero.

source: **{tick} Reward Message has been set. Type `{prefix}rewardtest` to test how it looks!**
es_es: **{tick} El mensaje de recompensa ha sido establecido. Escribe `{prefix}rewardtest` para probar cómo se ve!**

source: Adds Level to the mentioned user
es_es: Agrega un nivel al usuario mencionado.

source: Hey, You cannot add level more than 99
es_es: Oye, no puedes agregar niveles mayores a 99.

source: Cannot add level to a bot.
es_es: No se puede agregar un nivel a un bot.

source: {tick} Added level `{level}` for {member}**
es_es: {tick} Se agregó el nivel `{level}` para {member}**

source: Reset the level of entire server. Only Server Owner can do this and this cannot be undone
es_es: Resetea los niveles de todo el servidor. Solo el dueño del servidor puede hacer esto y no se puede dehacer.

source: {tick} Done! I have reset the levels of this server.
es_es: {tick} Listo! Reseteé los niveles de este servidor.

source: Change how levelroles get given out. **Stack: ** When leveling up, users keep their previous levels **Replace: ** When leveling up, users only keep their highest role.
es_es: Cambia como los roles de nivel son dados. **Stac:k ** Al subir de nivel, los usuarios se quedan con sus niveles previos. **Replace: ** Al subir de nivel, los usuarios solo se quedan con su rol más alto.

source: {tick} Now when leveling up, users keep their previous levels
es_es: {tick} Ahora cuando suban de nivel, los usuarios se quedarán con sus niveles previos.

source: {tick} Now when leveling up, users only keep their highest role
es_es: {tick} Ahora cuando suban de nivel, los usuarios se quedaran solo con su rol más alto.

source: **Examples :** `{prefix}rewardstyle stack` `{prefix}rewardstyle replace`
es_es: **Ejemplos:** `{prefix}rewardstyle stack` `{prefix}rewardstyle replace`

source: Invalid Style Provided, Please provide `replace` or `stack` as argument.
es_es: Estilo proporcionado inválido, por favor proporciona `replace` o `stack` como argumento.

source: Make roku only send role reward messages.
es_es: Haz que Roku solo mande mensajes de recompensa de roles.

source: **{tick} Now I will only send role reward messages**
es_es: **{tick} Ahora solo enviaré mensajes de recompensa de roles.**

source: **{tick} Now I will send all levelup messages**
es_es: **{tick} Ahora enviaré todos los mensajes de subida de nivel.**

source: Disable channels from giving xp for chatting in it. Incase if u dont want ppl to spam in #spam or #bots channel.
es_es: Deshabilita los canales para que no den xp por chatear en ellos. En caso de que no quieras que la gente haga spam en canales de #spam o #bots.

source: You need to provide atleast one channel. Eg: `{prefix}{invoked_with} #spam #bots`
es_es: Necesitas proporcionar por lo menos un canal. Ej: `{prefix}{invoked_with} #spam #bots`

source: Enable a previously disabled channel from giving xp for chatting in it. Incase u dont want ppl to spam in #spam or #bots channel.
es_es: Habilita un canal previamente deshabilitado para que no dé xp por chatear en él. En caso de que no quieras que la gente haga spam en canales de #spam o #bots.

source: You need to provide atleast one channel. Eg: `{prefix}{invoked_with} #general #general-2`
es_es: Necesitas proporcionar por lo menos un canal. Ej: `{prefix}{invoked_with} #general #general-2
