Repository: rokubot/bot
Catalog: locales/*/LC_MESSAGES/util.po
Languages: es_es

source: Some useful commands that don't fit elsewhere. For eg Google, anime etc
es_es: Algunos comandos útiles que no encajan en otro lado. Por ejemplo: Google, anime, etc.

source: Took so long. Can't wait for you any longer, Aborting...
es_es: Tardaste mucho, no puedo esperarte mas tiempo. Abortando...

source: Search queries from Google
es_es: Realiza un búsqueda en Google.

source: No results found for this query!
es_es: No se encontraron resultados para esta busqueda!

source: Internal Error Occured, Come again later
es_es: Error interno, vuelve más tarde.

source: Search a page from wikipedia.
es_es: Busca una página de wikipedia.

source: No Pages Found
es_es: No se encontraron páginas.

source: Takes the screenshot of the website
es_es: Saca captura de pantalla del sitio web.

source: Anime quotes
es_es: Frases de anime

source: Get Animal Pics. Bring Random Animal If name is not Provided
es_es: Obtiene fotos de animales. Da animal al azár si no se provée el nombre.

source: A todo list. Helps in keeping tracking of things to do
es_es: Una lista de pendientes. Ayuda manteniendo un seguimiento de las cosas pendientes.

source: No tasks found.
es_es: No se encontraron tareas.

source: Add a task by `{prefix}todo add`.
es_es: Agrega una tarea utilizando `{prefix}todo add`.

source: For more help on this command,type `{prefix}help todo`
es_es: Para obtener más ayuda con este comando, escribe `{prefix}help todo`

source: A todo list. Helps in keeping tracks of tasks or things to do.
es_es: Una lista de pendientes. Ayuda manteniendo un seguimiento de tareas o cosas pendientes.

source: No tasks found. Add a task by `{prefix}todo add`.
es_es: No se encontraron tareas. Agrega una tarea utilizando `{prefix}todo add`.

source: Add tasks to todo list
es_es: Agrega tareas a la lista de pendientes.

source: {tick} Added the task to todo list
es_es: {tick} Tarea agregada a lista de pendientes.

source: Add things to todo list
es_es: Agrega cosas a la lista de pendientes.

source: You can only add 20 tasks in todo.
es_es: Solo puedes agregar 20 tareas en la lista de pendientes.

source: You need to be a **premium user** to add more things
es_es: Necesitas ser un **miembro premium** para agregar mas cosas.

source: **Iron Patreon** - upto 100 todo things
es_es: **Patreon Hierro** - hasta 100 cosas en lista de pendientes.

source: **Bronze Patreon** - upto 200 todo things
es_es: **Patreon Bronce** - hasta 200 cosas en lista de pedientes.

source: **Silver Patreon** - upto 300 todo things
es_es: **Patreon Plateado** - hasta 300 cosas en lista de pendientes.

source: **Gold Patreon** - upto 400 todo things
es_es: **Patreon Dorado** - hasta 400 cosas en lista de pendientes.

source: **Platinum Patreon** - unlimited todo things
es_es: **Patreon Platino** - cantidad ilimitada de cosas en lista de pendientes.

source: You can't add more things in todo.
es_es: No puedes agregar mas cosas en la lista de pendientes.

source: You need to have a higher premium subscription to add more things
es_es: Tienes que tener una suscripción premium superior para agregar mas cosas.

source: **Gold Patreon** - upto 300 todo things
es_es: **Patreon Dorado** - hasta 300 cosas en lista de pendientes

source: **Diamond Patreon** - unlimited todo things
es_es: **Patreon Diamante** - cantidad ilimitada de cosas en lista de pendientes.

source: Remove things from todo list
es_es: Remueve cosas de la lista de pendientes.

source: You don't have any things in todo
es_es: No tienes cosas en la lista de pendientes.

source: {tick} Removed the task from todo list
es_es: {tick} Se ha borrado la tarea de la lista de pendientes.

source: {tick} cleared the task from todo list
es_es: {tick} Se ha borrado la tarea de la lista de pendientes.

source: An error occurred: {status} {reason}
es_es: Ocurrió un error: {status} {reason}

source: Brings Specified Subreddits. Nsfw Subreddits Only works in NSFW Channels
es_es: Muestra subreddits especificado. Subreddits NSFW solo funcionan en canales NSFW.

source: No posts found with the given subreddit
es_es: No se encontraron publicaciones dentro del subreddit mencionado.

source: {:,.0f}% Upvotes | Posted to r/{subreddit}
es_es: {:,.0f}% Upvotes | Publicado a r/{subreddit}

source: Add, Subract, Multiply and Divide Numbers. Usage examples: 1. Addition - `Ro calc 3 + 5` 2. subraction - `Ro calc 5 - 3` 3. Multiplication - `Ro calc 3 x 5` or `Ro calc 3*5` 4. Division - `Ro calc 20 / 5`or `Ro calc 0 ÷ 5`
es_es: Suma, resta, multiplica y divide números. Ejemplos: 1. Suma - `Ro calc 3 + 5` 2. Resta - `Ro calc 5 - 3` 3. Multiplicación - `Ro calc 3 x 5` o `Ro calc 3*5` 4. División - `Ro calc 20 / 5` o `Ro calc 0 ÷ 5`

source: Invalid expressions was given, please try again.
es_es: Fueron dadas expresiones inválidas, por favor intenta nuevamente.

source: Powers are not supported.
es_es: Poderes no son soportados.

source: It's Basic Maths lol! You can't divide any number with 0.
es_es: Son matemáticas básicas lol. No puedes dividir entre 0.

source: This operation breaks my memory
es_es: Esta operación sobrecarga mi memoria.

source: What's this question lol? please check `{prefix}help math` to see how to use this command.
es_es: ¿Qué es esta pregunta? Lol. Por favor ve `{prefix}help math` para ver cómo utilizar este comando.

source: Invalid expressions was given, please check `{prefix}help math` to see how to use this command.
es_es: Fue dada una expresión inválida, por favor ver `{prefix}help math` para ver cómo utilizar este comando.

source: Shows colorinfo from given name or hex
es_es: Muestra colorinfo del nombre o hex dado.

source: Creates QR Code from the given text
es_es: Crea Código QR a partir del texto dado.

source: Gives info on the given anime
es_es: Da info sobre el anime mencionado.

source: Error Occured : {reason}
es_es: Ocurrió un Error: {reason}

source: No Anime found with the given name
es_es: No se encontró un anime con ese nombre.

source: Searches urban dictionary.
es_es: Busca en urban dictionary

source: No results found, sorry.
es_es: No se encontraron resultados, lo siento :(

source: Interactively creates a poll with the following question. To vote, use reactions!
es_es: Crea encuesta de forma interactiva con la siguiente pregunta. Reacciona para votar!

source: Need Read Message History and Add Reactions permissions.
es_es: Se necesitan los permisos de leer el historial de mensajes y de añadir reacciones.

source: Say poll option or {prefix}done to publish poll.
es_es: Di poll option o {prefix}done para publicar encuesta.

source: {prefix}done
es_es: {prefix}hecho

source: Add emotes (custom emoji) to your server
es_es: Agrega emojis (emoji personalizado) a tu servidor

source: Could not download file...
es_es: No se pudo descargar el archivo...

source: **__Emoji Added__** Name: {name} ID: {eid}
es_es: **__Emoji Agregado__** Nombre: {name} ID: {eid}

source: Makes a poll quickly. The first argument is the question and the rest are the choices.
es_es: Crea la encuesta más rápido. El primer argumento es la pregunta y el resto son las opciones.

source: Need at least 1 question with 2 choices.
es_es: Se necesita por lo menos 1 pregunta con 2 opciones.

source: You can only have up to 20 choices.
es_es: Solo puedes agregar hasta 20 opciones.

source: Custom Embed
es_es: Incrustación Personalizada

source: Creates embed from json embed.
es_es: Crea una incrustación a partir de un json.

source: No embed found!
es_es: No se encontraró el incrustado!

source: Create a Custom Embed in an interactive way.
es_es: Crea una Incrustación Personalizada de un modo interactivo.

source: Type `quit` to quit without making an embed.
es_es: Escribe `quit` para salir sin crear un incrustado.

source: Type `done` to complete.
es_es: Escribe `done` para completar.

source: Type `skip` to skip.
es_es: Escribe `skip` para saltear.

source: title
es_es: título

source: description
es_es: descripción

source: image
es_es: imagen

source: thumbnail
es_es: miniatura

source: footer
es_es: pie

source: footer icon
es_es: ícono de pie

source: author
es_es: autor

source: author icon
es_es: ícono de autor

source: What would you like the **Embed's {property}** to be? {done} {quit} {skip}
es_es: ¿Cómo te gustaría que sea la **{property} del Incrustado**? {done} {quit} {skip}

source: quit
es_es: salir

source: OK Aborting....
es_es: De acuerdo, abortando...

source: skip
es_es: saltea

source: done
es_es: hecho

source: Color **{color}** is an invalid color or hex.
es_es: Color **{color}** es un color o hex inválido.

source: You have provided invalid image link.
es_es: Has proporcionado un enlace de imagen inválido.

source: Edit the embed created by the bot.
es_es: Edita la incrustación creada por el bot.

source: That message doesn't have an embed
es_es: Ese mensaje no tiene un incrustado.

source: Type `none` to leave something empty
es_es: Escribe `none` para dejar algo vacío.

source: What would you like the **Embed's {property}** to be? {done} {quit} {skip} {none}
es_es: ¿Cómo te gustaría que sea la **{property} del Incrustado**? {done} {quit} {skip} {none}

source: none
es_es: ninguno
